app/controllers/references_controller.rb

  def create
    entry = Bio::PubMed.query(params[:retrieve][:PMID]) # searches PubMed and get entry
    medline = Bio::MEDLINE.new(entry)     # creates Bio::MEDLINE object from entry text
    reference = medline.reference
    @attr = { :abstract => reference.nature }
    @reference = current_user.references.build(@attr) # converts into Bio::Reference object
    if @reference.save
---
INSERT INTO `references` (`created_at`, `title`, `journal`, `updated_at`, `abstract`, `pmid`, `refblob`, `user_id`, `authors`) VALUES('2010-06-03 03:00:55', NULL, NULL, '2010-06-03 03:00:55', 'Wang, X., Hripcsak, G., Markatou, M. & Friedman, C. Active computerized pharmacovigilance using natural language processing, statistics, and electronic health records: a feasibility study. J Am Med Inform Assoc 16, 328-337 (2009).', NULL, NULL, 1, NULL)
INSERT INTO `users` (`name`, `encrypted_password`, `salt`, `created_at`, `updated_at`, `admin`, `remember_token`, `email`) VALUES('Peter Kos', '1525aad3748d1942f6993ddd38827a8ca7eaf69a2217be0edd75834b414a9425', 'bf423d4b039b3374008687837d358b83fccad01a57eb7851ead1666ba3a3b190', '2010-06-03 02:56:25', '2010-06-03 02:56:25', 0, NULL, 'peter_kos@hms.harvard.edu')

  def destroy
    @reference.destroy
---
DELETE FROM `references` WHERE `id` = 43