app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 0, 30
SELECT count(*) AS count_all FROM `users`
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `references` WHERE (`references`.user_id = 1) ORDER BY created_at DESC
---
def export
  response.headers['Content-Type'] = "application/vnd.word"
  response.headers['Content-Disposition'] = 'attachment; filename="references.doc"'
  response.headers['Cache-Control'] = ''
  @user = User.find(params[:id])
  @references = @user.references.find(:all)

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `references` WHERE (`references`.user_id = 1) ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `references` WHERE (`references`.user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @references = @user.references.paginate(:page => params[:page])

INSERT INTO `users` (`name`, `encrypted_password`, `salt`, `created_at`, `updated_at`, `admin`, `remember_token`, `email`, `style`) VALUES('Peter Kos', 'eb132c87ea6c24617d6a2d2694a4bd1f20265e83a9da07e4ae1418922ee55d6f', 'cec3e87558d1980d881f65a1ddacb5def935acf198329821a17a7b13b9000d02', '2010-06-22 05:31:16', '2010-06-22 05:31:16', 0, NULL, 'peter_kos@hms.harvard.edu', 'science')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2010-06-22 05:01:37', `salt` = 'e609fa19cd4e0f65e66208c6114673faa33ffa299e8f540b493d661f98ef83c9', `style` = 'science', `encrypted_password` = '1f8478b471f7849e14721cb781f07bd154e6c8f170802ff0b610dc691d9d081b' WHERE `id` = 1
---
  def update
    if @user.update_attributes(params[:user])

DELETE FROM `users` WHERE `id` = 2
SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def destroy
    User.find(params[:id]).destroy